import {useState} from 'react'
import TableBP from './TableBP'
import Tablethuphi from './Tablethuphi'
import './truetable.scss'
function TrueTable(props:any) {
    const [detail,setDetail]=useState(false)
    const list3:Array<any> = [
      {title: "STT" },
      {title: "Mã" },
      {title: "Nội dung thu" },
      {title: "Học kỳ" },{title: "Số tiền(VNĐ)" },
  ]
  const list4:Array<any> = [
     [
      {title: "STT" },
      {title: "Mã" },
      {title: "Nội dung thu" },
      {title: "Học kỳ" },{title: "Số tiền(VNĐ)" }],
      [
        {title: "STT" },
        {title: "Mã" },
        {title: "Nội dung thu" },
        {title: "Học kỳ" },{title: "Số tiền(VNĐ)" }],
        [
          {title: "STT" },
          {title: "Mã" },
          {title: "Nội dung thu" },
          {title: "Học kỳ" },{title: "Số tiền(VNĐ)" }],
          [
            {title: "STT" },
            {title: "Mã" },
            {title: "Nội dung thu" },
            {title: "Học kỳ" },{title: "Số tiền(VNĐ)" }],
            [
              {title: "STT" },
              {title: "Mã" },
              {title: "Nội dung thu" },
              {title: "Học kỳ" },{title: "Số tiền(VNĐ)" }],[
                {title: "STT" },
                {title: "Mã" },
                {title: "Nội dung thu" },
                {title: "Học kỳ" },{title: "Số tiền(VNĐ)" }]
  ]
    return (<>
        <table className="Board">
        <thead className="Board-top">
        <tr>
              {
                 props.header.map((e:any,index:number) => {
                           return(
                            <th key={index}>{e.title}</th>
                           )
                      })
            }
              </tr>
          </thead>
      <tbody >
      {
        props.body.map((e:any,index:number) => {
          return(
           <tr key={index} >

              {
               e.map((a:any,index:number) =>{
                    return(
                       <th key={index}><span>{a.title}</span></th>
                    )
                }
                
                )
                                         
            }
               <th><i onClick={()=>{setDetail(true)}}>
               <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
<path fillRule="evenodd" clipRule="evenodd" d="M4.31452 16.0006C4.44405 16.2245 4.61577 16.5097 4.8285 16.8391C5.37489 17.6852 6.18406 18.8102 7.23457 19.9308C9.35721 22.1949 12.3249 24.2969 15.9996 24.2969C19.6742 24.2969 22.6419 22.1949 24.7645 19.9308C25.8151 18.8102 26.6242 17.6852 27.1706 16.8391C27.3833 16.5097 27.5551 16.2245 27.6846 16.0006C27.5551 15.7768 27.3833 15.4915 27.1706 15.1622C26.6242 14.3161 25.8151 13.1911 24.7645 12.0705C22.6419 9.80635 19.6742 7.70435 15.9996 7.70435C12.3249 7.70435 9.35721 9.80635 7.23457 12.0705C6.18406 13.1911 5.37489 14.3161 4.8285 15.1622C4.61577 15.4915 4.44405 15.7768 4.31452 16.0006ZM29.0366 16.0006C30.0966 15.4706 30.0965 15.4702 30.0962 15.4698L30.0943 15.466L30.0902 15.4579L30.0768 15.4316C30.0655 15.4096 30.0495 15.3788 30.0289 15.3398C29.9877 15.2619 29.9278 15.1511 29.8497 15.0122C29.6934 14.7344 29.4634 14.3432 29.1618 13.8762C28.5601 12.9444 27.6655 11.6991 26.4938 10.4493C24.172 7.97273 20.6212 5.33398 15.9996 5.33398C11.3779 5.33398 7.8271 7.97273 5.5053 10.4493C4.33359 11.6991 3.43905 12.9444 2.8373 13.8762C2.53568 14.3432 2.30569 14.7344 2.14946 15.0122C2.0713 15.1511 2.01147 15.2619 1.97024 15.3398C1.94962 15.3788 1.93364 15.4096 1.92234 15.4316L1.90889 15.4579L1.9048 15.466L1.90341 15.4687C1.90319 15.4692 1.90247 15.4706 2.96253 16.0006L1.90247 15.4706C1.73564 15.8043 1.73564 16.197 1.90247 16.5307L2.96253 16.0006C1.90247 16.5307 1.90225 16.5302 1.90247 16.5307L1.9048 16.5353L1.90889 16.5434L1.92234 16.5697C1.93364 16.5917 1.94962 16.6225 1.97024 16.6615C2.01147 16.7394 2.0713 16.8502 2.14946 16.9891C2.30569 17.2668 2.53568 17.6581 2.8373 18.1251C3.43905 19.0569 4.33359 20.3022 5.5053 21.552C7.8271 24.0286 11.3779 26.6673 15.9996 26.6673C20.6212 26.6673 24.172 24.0286 26.4938 21.552C27.6655 20.3022 28.5601 19.0569 29.1618 18.1251C29.4634 17.6581 29.6934 17.2668 29.8497 16.9891C29.9278 16.8502 29.9877 16.7394 30.0289 16.6615C30.0495 16.6225 30.0655 16.5917 30.0768 16.5697L30.0902 16.5434L30.0943 16.5353L30.0957 16.5326C30.0959 16.5321 30.0966 16.5307 29.0366 16.0006ZM29.0366 16.0006L30.0966 16.5307C30.2635 16.197 30.2631 15.8034 30.0962 15.4698L29.0366 16.0006Z" fill="#FF7506"/>
<path fillRule="evenodd" clipRule="evenodd" d="M15.9993 13.1569C14.4284 13.1569 13.1549 14.4304 13.1549 16.0013C13.1549 17.5722 14.4284 18.8457 15.9993 18.8457C17.5703 18.8457 18.8437 17.5722 18.8437 16.0013C18.8437 14.4304 17.5703 13.1569 15.9993 13.1569ZM10.3105 16.0013C10.3105 12.8595 12.8575 10.3125 15.9993 10.3125C19.1412 10.3125 21.6881 12.8595 21.6881 16.0013C21.6881 19.1431 19.1412 21.6901 15.9993 21.6901C12.8575 21.6901 10.3105 19.1431 10.3105 16.0013Z" fill="#FF7506"/>
</svg>

          </i></th>
                  
            </tr>
                    
            )
          })
          
      }      
      </tbody>
      </table>
      {detail &&  <div className="popup">
            <div className="popupcontext">
                <i onClick={()=>{setDetail(false);}} 
                className="Xone">
                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
<path fillRule="evenodd" clipRule="evenodd" d="M18.7869 3.85262C19.5159 3.12364 19.5159 1.94173 18.7869 1.21275C18.0579 0.483771 16.876 0.483771 16.1471 1.21275L10.0003 7.35949L3.85359 1.21275C3.12461 0.483771 1.9427 0.483771 1.21373 1.21275C0.484747 1.94173 0.484747 3.12364 1.21373 3.85262L7.36046 9.99935L1.21373 16.1461C0.484747 16.8751 0.484747 18.057 1.21373 18.7859C1.9427 19.5149 3.12461 19.5149 3.85359 18.7859L10.0003 12.6392L16.1471 18.7859C16.876 19.5149 18.0579 19.5149 18.7869 18.7859C19.5159 18.057 19.5159 16.8751 18.7869 16.1461L12.6402 9.99935L18.7869 3.85262Z" fill="#823B00"/>
                </svg>
                </i>
            <div className="upz">
              <h4>Số phiếu: <span>121235</span></h4>
              <h4>Mã hóa đơn: <span>121235</span></h4>
            </div>
            <Tablethuphi header={list3} body={list4}/>
          <div className="thanhtoancontainer">
            <h3 className="tongthanhtoan">Tổng thanh toán:
            <span className="tongthanhtien">69.699.699 đ</span></h3>
          </div>
          <button 
                 className="btnluu">Xem phiếu thu</button>                  
                  
               
                <p></p>
            </div>
        </div>}
      </>
    )
}

export default TrueTable
